#!/usr/bin/env bash

#变量 和 环境变量

name=cyx;

#使用变量之后,需要使用'$'符号，否则不起作用。
echo name;

echo $name;

echo ${name}; #个人还是喜欢这种写法,虽然麻烦一些，但是清晰


########################################################
########################################################


#在双引号中，也可以使用变量
userName=Simba;
userAge=20;
userAddress=南京;

echo "用户:${userName},年龄:${userAge},地址:${userAddress}";


##########################################################
##########################################################


#export命令用来设置环境变量
#环境变量是未在当前进程中定义、而从父进程中继承而来的变量。
#例如：
echo ${PATH};


#########################################################
#########################################################


#获取字符串长度
userNameStrLength=${#userName};
echo "userName length : ${userNameStrLength}";

CYXUserName="CYX123456";
echo "CYXUserName Str : ${CYXUserName}"
echo "CYXUserName Length : ${#CYXUserName}"

##########################################################
##########################################################


#检查用户是否为超级用户,root用户的UID是0
if [ $UID -ne 0 ]; then #注意 if 判断中的空格
        echo "${UID}";
        echo "Non root user. Please run as root";
else
        echo "${UID}";
        echo "root user";
fi;


###########################################################
###########################################################

